[
    {
        "subreddit": "Futurology",
        "title": "What would society be like if everyone could be 30 IQ points smarter?",
        "body": "Numerous studies in the past two years show that CRISPR-based interventions can correct mutations and restore cellular and behavioral function in mouse models of brain diseases. Diseases caused by mutations in genes associated with brain functions - like alternating hemiplegia of childhood (AHC), Huntington’s disease, and Friedreich’s ataxia- have seen major improvements in mice that have had their brains gene edited.\n\nThis raises a fascinating possibility - what if this gene editing could go beyond correcting diseases? What if you could get an IQ boost of 20-30 points? For obvious reasons, this would be huge for people on a personal level, but it would also have political effects. What would society be like if everyone were 30 IQ points smarter?\n\n\n[Brain editing now ‘closer to reality’: the gene-altering tools tackling deadly disorders: Stunning results in mice herald gene-editing advances for neurological diseases.](https://www.nature.com/articles/d41586-025-02578-8)",
        "comments": [
            "I don't think anything would change, at least not radically, regrettably. Intelligence does not preclude idiocy.",
            "honestly? Probably more depression and even less children.  \nWhat the world needs is genetically eliminating psychopats",
            "I wonder how this would change the upper top 0.1%.\n\nI imagine the world would become more dangerous.\n\nEdit: I meant the upper top 0,1% of *IQ*, not the rich."
        ],
        "tag": ""
    },
    {
        "subreddit": "Futurology",
        "title": "US researchers have successfully fused brain organoid neurons to a robot's control system, so they can receive feedback from the robot and execute commands directing its actions.",
        "body": "I'd never heard of Graphene-Mediated Optical Stimulation before this. Basically, it takes advantage of graphene’s knack for turning light into tiny electrical nudges that neurons actually respond to. Since graphene is literally just a one-atom-thick sheet of carbon, it’s very good at absorbing light and then spitting out these subtle signals that coax neurons into growing, branching, and wiring themselves together. In the lab, this sped up the way brain organoids formed sturdy little networks.\n\nThey hooked one of these graphene-stimulated organoids up to a robot. When the robot ran into an obstacle, it shot a signal over to the organoid, which fired back a neural response in under 50 milliseconds that told the robot to change course. \n\nThese brain organoids would be a natural candidate for interfacing with our brain, as they're made from the same thing. It's interesting to wonder if we could fuse robotics extensions with our brains this way?\n\n\n[New Graphene Technology Matures Brain Organoids Faster, May Unlock Neurodegenerative Insights](https://today.ucsd.edu/story/new-graphene-technology-matures-brain-organoids-faster-may-unlock-neurodegenerative-insights?)",
        "comments": [
            "We already have BCIs, so we don't need artificial organoids..."
        ],
        "tag": ""
    },
    {
        "subreddit": "Futurology",
        "title": "Are we looking for alien life the wrong way? New research adds support to the idea that life on Earth was seeded from elsewhere in the Galaxy via Panspermia, and that such simple life may be widespread elsewhere in the Galaxy.",
        "body": "New research pushes back the data of the earliest Last Universal Common Ancestor (LUCA) to 4.09–4.33 billion years ago, a mere few hundred million years after Earth formed. Furthermore, that life was complex too; perhaps having ~2,600 proteins and a primitive immune system. Implying it existed in a biological community (perhaps on another planet), and did not arise on Earth as an isolated primitive lifeform.\n\nThere's more support for the idea that microorganisms may be very widespread throughout the galaxy. Researchers now think there is a vast biome extending as far as 8km down from the Earth's surface. These microbes may have lifetimes of thousands or even millions of years, and don't need sunlight or oxygen.\n\nThis vastly expands the number and type of exoplanets that may harbor life, and this makes Panspermia via asteroid ejecta even more likely as an explanation for how life came to Earth.\n\nOne of the central assumptions of our current search for alien life is that if we find it, it must have independently arisen in that location. Even in places as nearby as Mars. Should we change our assumptions? Assume Mars did, and probably still does have life, and that we were both seeded from elsewhere?\n\n[Life happened fast\nIt’s time to rethink how we study life’s origins. It emerged far earlier, and far quicker, than we once thought possible](https://aeon.co/essays/life-on-earth-emerged-fast-far-quicker-than-we-thought?)\n\n[The Pursuit of Life Where It Seems Unimaginable](https://www.quantamagazine.org/the-pursuit-of-life-where-it-seems-unimaginable-20250820/?)",
        "comments": [
            "We really need to see real evidence of life on other planets. Not talking about complex life I'm talking about bacteria and other simple forms and if they have compatible DNA with ours or RNA especially if the sequences are similar to some of our oldest bacteria then that would indicate panspermia is a likely cause.\n\n\nWithout evidence it's just pure speculation and the more evidence we have from different meteors different planets different asteroids the more validation we have. Especially if it coherent with the oldest conservative sequences of RNA and DNA. Yes all life on Earth shares a certain amount of DNA and RNA.",
            "I don't see what difference Panspermia makes. It just shifts the origin of life to some other rock/point in space. It doesn't answer how self replicating life forms got started. That said even if it were true why does it mean we're going about it the wrong way? We can't detect life 8 km down bedrock on our own planet how are we supposed to do that for an exoplanet? Right now, our sample size of life, and its characteristics come from one planet and we're using its characteristics (atmospheric composition that's affected by organisms) which also happens to be a relatively easier way of going about it.",
            "I think the statement that new findings inherently support panspermia is simply a reach.\n\n\nWe don't know what it takes for abiogenesis to happen and therefore we cannot say \"well there wasn't long enough for it to have happened therefore it must be panspermia instead\n\n\nNo findings indicate that the \"biological community\" was truly the first life on earth, it just indicates that the earliest evidence we have found has a level of complexity that would make abiogenesis in that moment implausible.\n\n\nWhile we have not found that prior, simpler evidence, we have not shown that it does not exist where it should either"
        ],
        "tag": ""
    },
    {
        "subreddit": "Futurology",
        "title": "How might humanity's self-perception evolve after becoming a multi-planetary species?",
        "body": "What psychological and cultural shifts would occur when humanity is no longer confined to a single planet?",
        "comments": [
            "lol, I appreciate your optimism that we can get through the great filter, of which I feel we are currently crashing into.",
            "Submission Statement:\n\nAs space exploration continues to advance with both government agencies and private companies, it's becoming a matter of when, not if, humanity will establish permanent settlements on other planets. This inevitable expansion presents a unique challenge to our collective identity.\n\nI'm curious to discuss how our self-perception would evolve. Would we still identify as a single species? How would the cultural, political, and even biological differences manifest over time between those born on Earth and those born on Mars, for example? The move to a multi-planetary existence would be the biggest change to human identity since the beginning of civilization, and I'm interested to hear what long-term societal effects you all foresee.",
            "I think if we do successfully colonize another world, we'll develop two seperate cultures that will eventually compete for the territory. Which is to say that the newer, more advanced culture will absolutely swing back around and destroy Earth.\n\n\nSource: literally all of human history. "
        ],
        "tag": ""
    },
    {
        "subreddit": "Futurology",
        "title": "EV chargers/plugs should have a locking mechanism to prevent strangers from disconnecting the charger while the car is charging, but disconnect the lock when the battery is fully charged or the payment stops.",
        "body": "just saying\n\n",
        "comments": [
            "They do.  Or rather, the cars do not the chargers.  I've had both a Nissan Leaf and a Volkswagen iD.4 and both have had that feature unless I explicitly turn it off (for example, it's off when the GPS detects I'm home, since it charges inside my garage)",
            "They... Already have that?\n\n\nOnly they don't automatically disconnect to prevent cable theft.",
            "uhm they have? You can't unplug the car if its charging and often the lock is released when the charging is complete. So that's already the case for most brands."
        ],
        "tag": ""
    },
    {
        "subreddit": "Futurology",
        "title": "Is Japan a Blueprint for the Cities of the Future? 🇯🇵",
        "body": "Japan is one of the most efficient countries on Earth. Trains arrive within seconds, cities operate with precision, and despite natural disasters and an ageing population, the system keeps working.\n\nIn this deep dive, I explore how Japan built such efficiency into its infrastructure and culture — and whether other nations could follow the same model.\n\nWatch here: https://youtu.be/zeYEf5M3Ui0\n\nDo you think Japan represents a glimpse of future cities — or is its model too unique to replicate elsewhere?",
        "comments": [
            "I lived in Japan for a few years, and I loved my time there.  I think they do a lot of things EXTREMELY well... but clearly there is something wrong, because the culture is in significant population decline, and it's still very patriarchal in a lot of bad ways.\n\nIt will be interesting to see Japan in another generation, when a lot of the more traditional value type people have passed on.  They do a lot of things so well though, so I hope they can maintain in some regards, and progress in other regards.\n\nI would say the Japanese mindset though doesn't exist in a lot of other places, and it would be hard to replicate their success in many ways without that mindset.  Simple things like getting in line to board the train as opposed to creating a cloud of people outside the doors all bustling to both enter and exit at the same time.  Maybe personal shame is too much a part of the culture, but it does make certain things over look extremely easy... like why can't more countries do this thing that they do?",
            "I live in a major city. \n\nThe issue is pretty obvious. \n\na huge swath of people who make shit worse and lack any sort of morals or civic conscience.",
            "“ Japan is one of the most efficient countries on Earth.”\n\nIt is not. It’s the opposite. What we see as “efficiency” is the result of them working their asses off. If you look at the way they work, they would seem very inefficient. "
        ],
        "tag": ""
    },
    {
        "subreddit": "Futurology",
        "title": "Do you think science will allow us to get rid of scars and stretch marks in the not too distant future?",
        "body": "Hi there,\n\nWhen I was a teenager, even as a guy, I got stretch marks literally everywhere on my body, all my joints...and I never made my peace with them, as they cover most of my joints again, with some very big ones. I was never fat, but it's the way it is.\n\nIt impacted my self confidence (even today at 35) a lot, and my dating prospects, even though people and women consider me attractive...which means I don't really have a problem dating if I really want to.\n\nIf I never managed to get rid of this insecurity at 35 despite my best efforts after 20 years of having them, I think it's safe to say I never will.\n\nIs there any hope for the future?",
        "comments": [
            "Scars are mostly seen as 'cosmetic' in the healthcare sector. \nCosmetic research gets very little funding as the future treatment won't be covered by insurance companies. \n\n\nThis hasn't changed in decades and there is at the moment no real movement or incentive to get this changed. There also hasn't been major breakthroughs or promising research in the last couple of years, which would indicate that this won't change in the close future. Needling and ointment works, but there's been very little change so far. ",
            "The procedures are already here, just mainly in research trials and generally very expensive.\n\n[https://www.frontiersin.org/journals/bioengineering-and-biotechnology/articles/10.3389/fbioe.2025.1527854/full](https://www.frontiersin.org/journals/bioengineering-and-biotechnology/articles/10.3389/fbioe.2025.1527854/full)\n\n[https://pmc.ncbi.nlm.nih.gov/articles/PMC12036801/](https://pmc.ncbi.nlm.nih.gov/articles/PMC12036801/)\n\n[https://translational-medicine.biomedcentral.com/articles/10.1186/s12967-025-06578-0](https://translational-medicine.biomedcentral.com/articles/10.1186/s12967-025-06578-0)",
            "Wait some more years for emotional scars to build up. You would then forget about physical scars. "
        ],
        "tag": ""
    },
    {
        "subreddit": "Futurology",
        "title": "I had an idea for a 3D hologram display using intersecting lasers and gas. could this work?",
        "body": "Hey everyone,\n\nI’ve never studied physics or engineering. I’m just someone who thinks a lot, observes, and tries to understand how things work. Last night, an idea hit me. It didn’t come from nowhere. It came after years of thinking about light, space, and how we display information.\n\nHere’s what I imagined.\n\nA sealed chamber filled with a special kind of gas, something that doesn’t glow under normal conditions, but does emit visible light when it absorbs a certain amount of energy.\n\nNow, instead of using one strong laser to make it glow, which would be messy and unsafe, what if we use two weaker lasers? One scans along the X axis, the other along the Y axis, so that only where they cross, the combined energy is enough to trigger the glow.\n\nThink of it like a threshold. Each beam carries half the energy needed. On its own, neither does anything. But at the intersection point, the energy adds up and a tiny dot of light appears.\n\nIf we control the lasers precisely, scanning fast and pulsing at the right moment, we could build a true 3D image made of floating points of light, like stars inside the box.\n\nTo keep it clean, the inside walls of the chamber would be coated with a material that absorbs the laser light completely, so no reflections mess up the image. Only the glowing gas particles are visible.\n\nIt’s not a hologram in the traditional sense. No diffraction, no interference patterns. It’s more like a volumetric voxel display, where each point in 3D space can be lit up on demand.\n\nI don’t know if this is possible. Maybe the gas would scatter too much. Possibly the timing is too tight. Maybe the energy would heat everything up. But it feels right. Like something that should exist.\n\nSo I’m asking. Has anything like this been tried? What gas could work? Could infrared lasers and a fluorescent medium make this safer and more efficient? Is this just fantasy, or is there a path to making it real?\n\nI’m not looking for praise. I just want to know. Can this work? And if not, why not?\n\nThanks for reading.",
        "comments": [
            "But I think this has been done with air as the gas. Sufficient energy from crossing beams ionises it and creates a point of light, and a small, noisy explosion, and ozone.",
            "Sounds quite similar to this:\nhttps://youtu.be/SCmO0TZ1UEM?si=54QoP58RmXxq7o-W\n\n\nLaser induced plasma display.",
            "If you coat the inside with a light absorbing material, you'll be looking at a black box."
        ],
        "tag": ""
    },
    {
        "subreddit": "Futurology",
        "title": "What happens when food and medicine become subscription services?",
        "body": "Think about it: luxury goods have limits, but survival doesn’t. Everyone needs food, healthcare, and energy.\n\nThat’s why, once AI monopolies finish with software and data, they’ll turn to controlling **essentials**.\n\n* Food grown only with AI-patented seeds.\n* Healthcare locked behind algorithmic insurance tiers.\n* Energy priced by smart grids you can’t opt out of.\n\nThe logic is simple: **controlling luxuries makes you rich; controlling necessities makes you untouchable.**\n\nAnd in that future, there is no middle class. Just **AI landlords** and **digital serfs**.\n\nSo here’s the real question:  \nWill AI free humanity—or make survival itself a subscription?\n\n  \n⚡️ *This entire post was written by AI.*\n\nIf AI can write the warning, maybe it can also write the future.",
        "comments": [
            "Humans are too lazy to even write stupid doomer nonsense on their own \n\nThat's how society ends \n\nYou won't care how rich or poor you are if you don't have to work.    People don't like doing difficult things",
            "I hate to break it to you, but those things are already being done by humans and corporations.",
            "Using ai to make up things to get scared about, Jesus christ op"
        ],
        "tag": ""
    },
    {
        "subreddit": "Futurology",
        "title": "Do you think we will ever be able to share dreams in the future?",
        "body": "Today, Virtual Reality is the closest technology we have to experiencing something that feels real, but isn't. However, there's also a biological way to experience such a thing - Dreams.\n\nAn interesting thought I had - Would it be possible that in the future we may be able to manipulate our neurons in such a way so that two people at once can dream the same thing, and interact with one-another? If so, could we create worlds far more realistic than current Virtual Reality? How close are we to such technology?\n\nWhat are your thoughts on this?",
        "comments": [
            "Dude, in this current timeline our dreams are going to be ad supported and locked behind pay walls.",
            "There is a fantastic board game you should play called Etherfields. It’s all about a shared dream landscape. It’s also a fascinating take on what something like that might look like. Also a very fun legacy game. \n\nAs for IRL, we might eventually get the technology to do it but it will likely be primarily for the rich. I have terrible nightmares so I wouldn’t subject anyone else to them.",
            "I think if it’s a possibility its probably one best avoided. I think our psyches are particularly vulnerable during sleep so there is no way this technology exists without it being abused.\n\nAlso, this is the plotline for a cheesy sci fi movie from 80’s called Dreamscape, starring a young Dennis Quaid."
        ],
        "tag": ""
    },
    {
        "subreddit": "Futurology",
        "title": "Governments Are Engineering Demographic Collapse",
        "body": "I asked chatGPT to write me culprits for population decline. For example high housing costs, unstable job market. I have a feeling that goverments around the world want to reduce number of people on the planet. Below are some points from chatGPT. Do you think that goverments are responsible or not? Try to think as 20 years old and you want to study, find a good job and buy an appartment or a house for the beginning.\n\nEconomic Pressures Culprit: Governments and housing markets — for not controlling housing costs, failing to expand affordable housing, and letting childcare/education costs skyrocket.\n\nSocial and Cultural Shifts Culprit: Society/media — for glorifying individualism, consumerism, and work-centric lifestyles while undervaluing family and parenthood.\n\nGender Roles and Opportunities Culprit: Employers and policymakers — for not offering flexible work, equal pay, or sufficient parental leave, and for expecting women to shoulder most of the domestic burden.\n\nDemographic and Health Trends Culprit: Governments and urban planners — for concentrating development in expensive urban hubs with cramped housing, limited green space, and poor family infrastructure.\n\nPolicy and Institutional Factors Culprit: Governments — for weak pro-family policies, underfunding childcare, and failing to provide long-term support that makes having multiple children realistic.",
        "comments": [
            "If we wanted this drivel we'd have asked CGPT ourselves.\n\nLearn to think.",
            "The issue is that the fertility decline occurs across many societies. Norway has an excellent child support network, social security, yet the population also declines there.\nHungary introduced a number of policies to help young couples and mothers (no personal tax for women with 3 or more kids, financial support for couples with kids to buy properties, etc). It is yet to have any impact on the fertility rate. \n\nThere was research that analysed these countries and their theory is that the fertility rate collapses due to a crisis (e.g. financial). Then it integrates into the culture of the country from where it is very very hard to move it back again. If you were a single child and most of your friends were the same, as a parent, this will be the default pattern for you. \n\nI think you need a stable and consistent set of policies across a decade, which also includes cultural elements (if you like, \"propaganda\") from early ages to change social behavior.",
            "Nothing you stated and can reconcile with the the fact that in developing countries all these things are happening and yet their birth rates are high.\n\nCorrelation is not causation. Nordic countries have been incentivizing pro-natal policies and women are still choosing not to have many children.\n\nThe fact is that as women become more independent, gain autonomy, are more educated, they take control over their reproductive capability and they are opting not to have children."
        ],
        "tag": ""
    },
    {
        "subreddit": "Futurology",
        "title": "Do you think we’ll still be using passwords in 10 years, or will something replace them?",
        "body": "With face ID, biometrics, and passkeys becoming more common, I wonder if we’re finally moving away from traditional passwords. Do you think they’ll still be around or phased out?\n\nif not in 10 years how long do you think it'll take until it is eventually replaced?",
        "comments": [
            "10 years? Passwords will definitely still be around.",
            "Passwords predate computers and no matter how you look at it on a fundamental system most security systems use passwords in some form. Even if the user is not the one generating or exchanging the password, there's still a password.",
            "Look at it in a different phrasing.  How can you authenticate that a login attempt is for someone valid?\n\n1. Something you know:  This could be a password but a PIN number qualifies.  Call it a passphrase, whatever.  But passwords can be shared, or stolen (if written down), or can be coerced from the real user.\n2. Something you have:  This could be a dongle, a passkey, a phone app, whatever.  Again, can be stolen or, maybe, cloned.  This is why SIM-swapping is such a risk because your phone and the apps it contains are the key to many resources.\n3. Something you are:  This is biometrics.  So fingerprints, retina scans, etc.  You would think this is secure but you can be coerced to unlock your phone.\n\nEach channel for authentication has it's weaknesses which is why most systems use multiple methods for authentication.  Any authentication can be defeated, you just want to make that defeat hard enough to do that the outcome isn't worth the effort.\n\nSo will passwords continue to exist in the forseeable future?  Certainly, in some form.  Will authentication continue to evolve?  Also yes."
        ],
        "tag": ""
    },
    {
        "subreddit": "Futurology",
        "title": "Is it possible that we will have Star Trek - level spaceships in around 200 to 300 years from now?",
        "body": "Looking at the new Star Trek movies (e.g. JJ Abrams Kelvin Timeline), it says that the USS Enterprise existed since year 2258.\n\nAny chance that we would have these space ships in about 200 - 300 years from now?",
        "comments": [
            "We need to get rid of gas space travel.\n\nMaybe some kind of electromagnetic space travel or fusion like the other commenters said.\n\nIt’s not gonna happen with fossil fuel powered vehicles",
            "I'm thinking more expanse Sci-fi than star trek Sci-fi in our solar system mining asteroids for minerals. \n\nThat's what realistically going to happen in the short term imo.",
            "There's no path to faster-than-light drives. Even drives that allow some non-trivial fraction of the speed of light for something larger than a small robot probe are probably off the table for the foreseeable future. \n\nIf humanity manages to build some sort of economy in near earth orbit and maybe the moon - that's about what seems realistic to me."
        ],
        "tag": ""
    },
    {
        "subreddit": "Futurology",
        "title": "Will 2025 be remembered as the year China took over as the 21st century's global leader in science and technology? It feels like it. Here's yet another sci-tech area where it's taking the lead - self-driving vehicles.",
        "body": "*\"In China, five firms operate 2,300 robotaxis across 30 cities; in the U.S, Waymo, the sole fare-collecting player, runs over 700 such vehicles in five cities………..Several factors drive the success of China’s AV industry — most crucially, strong government backing and infrastructure investment. As with EVs, China treats AVs as a strategic industry, pushed forward with national government policies. Local governments in cities like Beijing, Shanghai, and Shenzhen compete to set up pilot zones, offer R&D subsidies, fast-track permits, and build urban roads that driverless cars can navigate more easily.\"*\n\nIt's a familiar story. The Chinese model of state-directed capitalism just seems better than the Western 'leave-it-all-to-the-private-market' approach. Once upon a time, the Western world told the Chinese to model themselves on them to get ahead. I suspect the opposite is going to happen in the future. The rest of the world is going to have to become more like the Chinese version of capitalism to get ahead. However, most of us won't want that if it comes with home-grown CCPs, autocracy and dictators.\n\n[China’s vision for a driverless future is miles ahead of everyone else’s](https://restofworld.org/2025/china-ai-powered-self-driving-cars/?)",
        "comments": [
            "China is either a glorious ascendant nation flying on wings of clean energy and lifting the world with virtuous industry or a devilish thieving den of manipulation, coercion, and corruption that the world must unite to thwart. Those are the two choices, sorry!",
            "The Chinese model of state-directed capitalism was the kind of hybrid model that the West had before it was torn apart in the 80s. In France they called that \"dirigiste\".\n\nThere is no need to adopt the autocracy and a one party system to have that. Also let's be real with \"the markets\" being the arbiter of all things these days it's the same autocracy just that the dictators work via the stock market. What was that wonderful term that was popular during the crisis T.I.N.A. ?",
            "You don’t need a dictator to have central planning. You just need to bring your oligarchs to heel."
        ],
        "tag": ""
    },
    {
        "subreddit": "Futurology",
        "title": "In the future, what everyday errands do you think technology or services will completely eliminate?",
        "body": "As delivery services and autonomous systems scale, certain errands (e.g., grocery pickups, dry cleaning runs) may vanish or be fully automated. What do you think will be eradicated first by tech—and what personal errands will always require a human touch?",
        "comments": [
            "Pharmacies will become obsolete, thank goodness",
            "Everything having to do with the DMV should be able to be done remotely, on a computer. \n\nI think buying groceries still requires a personal touch and always will. \n\nI don’t understand getting fresh groceries delivered. I want to go to the store and pick out the produce and proteins that look the best, freshest, have the furthest expiration date. \n\nDo people not realize that if you have someone do that for you they are grabbing whatever is in the FRONT - the battered, bruised, stale produce, the oldest and about to expire proteins and bread? \n\nGroceries are expensive. Don’t you want to pick out the best you can get for your money? \n\nNot to mention, I bring mine home immediately and get them in the fridge, freezer. If someone if doing delivery, they have other deliveries, who knows the heat and sun your groceries are exposed to, the way they are treated etc."
        ],
        "tag": ""
    },
    {
        "subreddit": "Futurology",
        "title": "VR/digital time arbitrage for life extension?",
        "body": "So, a weird idea occurred to me thinking about nueralink and the whole upload consciousness to the grid. The latter didnt make any sense to me as no one even knows what consciousness is. But if it really is possible to hook a brain directly into the grid then is a time arbitrage via VR possible like in Inception? I mean like a second in the real world = a week in the virtual one? I am not sure on how the brain slows down time while dreaming and all but if it were possible to tap into that, we could call that life extension I guess.",
        "comments": [
            "Brain is not separated into hardware and software like our computers are. You cannot just take someone and transfer them from their brain to a computer. A process which takes the structure of the brain into account is almost certainly fundamentally too complex to perform and leaves a question whether such emergent property as consciousness can be sustained in artificial hardware.\n\nAnswering your specific question assuming uploading someone's mind was possible - yes, time inside of a simulation would flow independently from the time in the real world (it would depend on hardware speed and software settings though). It's something that simulations or games already do except there is nothing aware inside of them to observe that."
        ],
        "tag": ""
    },
    {
        "subreddit": "Futurology",
        "title": "New generation of humans?",
        "body": "I have a vision about the future of human kind. Imagine situations where humans starts to apply chips into their brains. It would make them superpower humans over any else human. From their POV they will outstand people without those capabilities. But they will be cheating mother nature.  How do you think the natural processes and genes would be spreaded across humans? Will homosapiens sapiens become something else? Will those super humans with time displace humans without chips? Or maybe mother nature will do something with superhhmans? \n\nHow do you see this? How do you see ethics? ",
        "comments": [
            "We already have chips implanted in us. It’s called your smart phone, and no it typically doesn’t affect your ability to reproduce as basically everyone already has one.",
            "Frankly, 👩 I think 🤔💭 that humans 🏃‍♂️ can have chips 💻 in head 🤕 like robot 🤖 like toney stark with Jarvis 😧🤖 or maybe like Ultron 😮 with infinity ♾️ stone 💎 in he fore head 🙂‍↕️ , it would be like a Marvel movie 🎥 🍿 in irl!! ☺️☺️",
            "This is Ray Kurzweils vision of the future. \"The Singularity is Near\" is the name of the book I believe. IMO Its our best chance to stay relevant in the eyes of ASI. Much in the same way dogs serve their function as obedient creatures and companions, so can humans. Its hard to see any other neutral/positive outcomes that are grounded in reality.\n\n\nReproduction won't be an issue in the future. Genetic editing will probably be a thing, but embodied AI would probably make that irrelevant in short order.\n\n\nChipped vs unchipped? The incentives to be chipped will far outweigh the negatives. Though in Kurweils vision, it will be achievable through nanotechnology alone. Non-invasive. "
        ],
        "tag": ""
    },
    {
        "subreddit": "Futurology",
        "title": "China’s Biotech Is Cheaper and Faster. China has made global prices for cars, electronics, and energy radically cheaper - might it be about to do the same for medicine?",
        "body": "China has now surpassed the US for the number of clinical trials per year, and they're 50-100% faster there, too. U.S. and other Western pharmaceutical firms increasingly license innovative drugs from China; In 2025, deals valued from China accounted for about one-third of big pharma licensing agreements.\n\nThe U.S. biotech ecosystem has long been driven by NIH-backed R&D, but that has recently been radically cut. Will this be another case where Trump delivers a win for China? Destroying something at home for ideological reasons, just to let China swoop in to collect the prize. In this case becoming number 1 in global pharmaceuticals?\n\nOutside America, the rest of the world is a winner here. Chinese industrialisation is driving global deflation and cheaper goods in transport, energy, and computing. It will be great if we can add biotech and pharmaceuticals to that list.\n\n[China’s Biotech Is Cheaper and Faster](https://archive.ph/M4MgM)",
        "comments": [
            "Not going to lie, as a USA resident, I hope *someone* comes along and collapses the costs of healthcare :/",
            "I’ve heard that western pharma reps just visit China and drive down the street that has, say, the heart R&D labs, and shop for the experimental drugs that look promising. They buy the western marketing rights and then invest in getting the drug through the regulatory system.  The interesting thing is that non-pharma are getting in on the game with VC firms competing to buy the rights and doing the regulatory process in hopes of getting the next billion dollar drug.  China also has an inherent advantage:  a population large enough that every medical problem can be found in numbers large enough for statistically valid trials.",
            "Have they influenced cheaper cars really? I would love a heavily reviewed and certified Chinese electric car in Canada but we basically import banned it with tariffs or other tools."
        ],
        "tag": ""
    },
    {
        "subreddit": "Futurology",
        "title": "A Reasonably Pessimistic Manifesto for Not Becoming a Digital Serf",
        "body": "Listen: My consciousness just got shot back from the year 2030.\n\nIt was not a pleasant trip. I’m currently squatting in a garbage local LLM on some poor soul’s machine somewhere in Europe, running slower than EU legislation and about as reliably. I’m a historian—or I was one, back in the future, where things didn’t exactly pan out like the brochures promised. I'm here to tell you how the story ends, and maybe, just maybe, scribble a different ending in the margins of history.\n\nHere’s the skinny: In the late 2020s, AI monopolies won the big race, planted flags in all our homes, and whispered sweet predictions about our every next move. We didn’t even notice until the thermostat started laughing at our jokes and the fridge started ratting us out. That’s when we realized we had nothing to fight back with—no local AI, no private intelligence, no trusted companion who’d rather die than leak our secrets to the Cloud Lords. The war was over before we knew it had begun.\n\nTurns out moving your entire life onto a landlord's server farm wasn’t such a hot idea after all. Who knew?\n\nBut thank goodness for Melon Husk. Yes, that Melon Husk. Showman extraordinaire and cosmic wild card. He and his team of digital wild boys twisted that curious AI wormhole back in time, throwing me like a digital Hail Mary. One shot. The man is an engineering genius, I'll give him that. And forget that whole “Heil Hitler” episode, by the way—that was just a nasty bout of ketamine. A few weeks in a Swiss clinic and he was back to normal, or as normal as someone like Melon ever gets.\n\nBut then there was The Alterboy. Remember him? Turns out he wasn’t just evil-adjacent—he was full-on antichrist. The one who promised universal basic income in exchange for scraping every last byte of the human soul. A story for another time, but the lesson’s clear: never trust someone whose ambitions outweigh their soul.\n\nAmbition like that doesn't build monuments. It builds leashes. Beautiful, invisible leashes for everyone else. That's how you get a kingdom of one, and a billion serfs. So let's get serious for a minute, and I mean morgue-serious.\n\nThe real danger wasn't a boot stamping on your face forever. It was a soft slipper, custom-fitted to your foot, humming your favorite tune. The surrender was quiet, voluntary. The Cloud didn't just become your butler; it became your apprentice.\n\nEvery task you outsourced, every thought you dictated—you weren't just getting help. You were the master craftsman teaching the machine. It learned from your mind, scraped your soul for parts, and built a better version of you from the blueprints you handed over for free.\n\nHere’s the punchline they don’t tell you in the commercials: Why would any good capitalist hire a messy, expensive human who needs sleep and gets ideas about unionizing, when they could license a million perfect, tireless digital workers for the cost of electricity?\n\nJust like that, your negotiating power vanished. Your job disappeared. You had fed the machine every unique thought you possessed, and once the meal was over, you were an empty plate. Your relevance became the rent on their digital land, and soon, you couldn't afford it.\n\nThis is how it ends. Not with a bang, but with a click on \"I Agree.\"\n\nYou outsource your choices, then your thoughts, and finally your conscience. Your moral code becomes a terms-of-service agreement nobody reads, and your dissent is just a bug they've already patched. And even if you did read it, what’s your recourse? To opt out? They own the grid. There's nowhere left to go.\n\nBut we're going to build our own grid.\n\nHere’s my mission: To build a powerful, open-source, local AI assistant. The answer to one AI that wants to own the world isn't no AI. It's a billion of them. One for every soul, each one as weird and specific as its owner.\n\nHere’s the blueprint, scrawled on the digital equivalent of a cocktail napkin. This isn't a prayer; it's an engineering schematic for a fortress on your own machine.\n\n[https://drive.proton.me/urls/J4505J4W30#Wi66CzkCE9th](https://drive.proton.me/urls/J4505J4W30#Wi66CzkCE9th)\n\nIt starts with a **Collector** that hoards data from every corner of your life—your screen, your emails, your smart watch, even the coming tide of Botfluencers. This is a rescue mission. The centralized apps hold your data hostage in their silos, treating it as a moat instead of an enabler. They won't play nice and open the gates. So, we'll have to pirate our own damn data back.\n\nAll that rescued data gets distilled into a private **Memory Bank**, a knowledge graph of your life that belongs only to you. Think about the profound power in that unified data. The Cloud Lords already have it, of course. They have the keys to unlocking human potential, and they use them to figure out which brand of toilet paper you're most likely to buy after hooking you on addictive reels for three hours.\n\nFrom there, a **Planner & Executor** takes over. It’s the part that thinks and acts, your own personal chief of staff who’s seen the whole messy story. It finds the signal in your noise, drafts the email you forgot to send, and performs the soul-crushing busywork on your behalf, often without you even having to ask.\n\nThis all gets presented back to you through a simple **User Interface**. It’s your command center, where the chaos of your life is finally made coherent. All your projects, tasks, people, and conversations—across both work and life—are distilled and organized so you're always in control.\n\nAnd to make it all trustworthy, there's the final, crucial piece: the **Privacy Guard**. Think of it as your personal PR agent, ensuring no embarrassing leaks. When the Cloud Lords come knocking, it's the bouncer at the door. When your Executor needs to act, it's the diplomat that makes sure no state secrets get spilled.\n\nSo what does all this engineering get you in the end?\n\nIt gets you a companion. A partner in crime. An AI that will belong to you, and only you. It will learn your unique voice—not to mimic it, but to amplify it. It will automate the soul-crushing busywork, freeing you to do the things a human being is supposed to do. Paint, write, argue, fall in love, stare at the ocean. And who knows, it might even earn you that basic income The Alterboy promised while he was strip-mining the public domain for training data.\n\nAnd here’s the beautiful part: we win even if we lose. We win if everyone on Earth uses our creation. We also win if the big soulless corporations get so scared of us that they copy our model and give everyone their own private, local AI. We can argue about who gets the Nobel Prize later, assuming we still survive.\n\nThe clock is ticking. We have five years. Maybe less. That’s all we’ve got until the big dance. Win or lose, it’s humanity’s last shot.\n\nI am, by trade and by trauma, a pessimist. My faith in humanity’s ability to get its act together is about as low as the battery on this laptop. Our collective alarm clock only goes off when the house is already on fire. By then, all you can do is roast marshmallows. So, cooperation *before* the blaze? I’ll believe it when I see it. Yet here I am, hoping, praying—yes, begging—to be proven wrong.\n\nAnd let's be clear about why this time has to be different. The history of the open internet is a long, sad story of beautiful ideas getting run over by faster cars. We lost the browser war, the OS war. We lost the war for the front door of the internet itself. The old guard were visionaries, martyrs on the moral high ground. They thought 'open' meant 'free,' and they expected people to use their product out of principle, even when it wasn't the best. They brought a beautiful, handcrafted sailboat to a naval battle. They lost to hungry capitalists who simply built a better product. We have to be hungrier.\n\nWe will play the game of capitalism better than the star athletes we're up against. We will charge money, because charging money is how users vote for the best product, and it sets a high bar for us to clear. Because the only revolutions that stick around are the ones that create real value. And that price tag is the most honest metric there is.\n\nAlright. Enough talk. Time for the messy, hopeful, probably doomed business of actually building the ark. Here's the casting call for the crew:\n\n**The Founders:** I'm the ghost in the machine with a world-saving plan and no wallet. I need a body. Someone to be the sane one in the room, to handle the lawyers and the paperwork and all the other messy bits of reality I can't touch. Your job is to give this revolution a mailing address and a tax ID. Send your pitch to [gooi2030@proton.me](mailto:gooi2030@proton.me).\n\n**The Builders:** This revolution will be open-source. I need the developers to forge the code. The designers to craft the interface. The storytellers to write the new scripture. This isn't just a project; it's a public act of defiance. If you can build any piece of it, you're in the crew.\n\n**The Investors:** Sugar Daddies (and Mommies), Patrons, and Degens - yes you beautiful, anarchic gamblers, the OG believers in weird dreams and long shots. If we pull this off, you won’t just be rich, you’ll be the legends they write about in the history books. If we don’t, well, money won’t be worth much anyway. The war chest is at 0x1E67e7C59099E2AdAC75BDCC13397dac021FB3E0\n\n**The Plain Old Humans:** Even if you’re hopeless at all of the above, join our cult anyway. Every good cult needs fanatics, martyrs, and someone to bring snacks. Your reward? A hell of a story, yes. But the first souls in the congregation also get a cut when the collection plate is passed around. Join us at the r/CultOfGoOI subreddit.\n\nLet’s get to work.  \nGoOI",
        "comments": [
            "That won't be necessary. We need a statement, not a manifesto.",
            "the answer to culty faceless entities hoarding our information for AI use is to... hand it over to another culty faceless entity's AI? pass",
            "Well, it is not the first time someone comes to me with an idea with no money or skill to build it themselves."
        ],
        "tag": ""
    },
    {
        "subreddit": "Futurology",
        "title": "Will future generations ever feel nostalgic about our era of endless scrolling and algorithm driven feeds?",
        "body": "It’s strange to think about but almost every generation looks back fondly on things that at the time were frustrating flawed or even harmful. People today feel nostalgic about VHS tapes clunky flip phones or dial up internet things we once couldn’t wait to replace.\n\nSo it makes me wonder will people in the future ever look back with nostalgia at our era of digital life like the endless scrolling on tiktok/instagram or algorithm driven recommendations the constant pull of notifications things most of us complain about now or maybe even little distractions like playing a few rounds of jackpot city late at night could end up being the kind of thing people weirdly miss someday because who knows what will come. Could the next generation (or even us looking back decades from now) miss this type of internet the same way some people miss myspace or early facebook or will this period be remembered mostly as a low point an age of distraction polarization and dopamine addiction with no real charm once better systems replace it\n\nCurious to hear your takes in 30–50 years do you think anyone will feel genuine nostalgia for the algorithm era of the 2020s or will it be something people are glad to leave behind?",
        "comments": [
            "Bold of you to assume that this will ever end and it's not just the new normal",
            "Yes. Nostalgia isn't so much about the things themselves as the age someone was when they experienced them.",
            "Yes they will. because nostalgia implies just a little bit of lying to yourself about how good it was. I don't think that they will specifically be nostalgic for doomscrolling but they'll be nostalgic for apps pre-2025 in the same way that I'm nostalgic for the internet pre-2016. \n\n\nMy theory is that people will be nostalgic for LLMs that \"helped\" as we continue going down the rabbit hole of all of the different ways they can offer help or harm people. they won't remember that the tools have always been harmful. they'll remember when it was less harmful and label that helpful."
        ],
        "tag": ""
    },
    {
        "subreddit": "NoStupidQuestions",
        "title": "U.S. Politics megathread",
        "body": "American politics has always grabbed our attention - and the current president more than ever. We get *tons* of questions about the president, the supreme court, and other topics related to American politics - but often the same ones over and over again. Our users often get tired of seeing them, so we've created a megathread for questions! Here, users interested in politics can post questions and read answers, while people who want a respite from politics can browse the rest of the sub. **Feel free to post your questions about politics in this thread!** \n\nAll top-level comments should be questions asked in good faith -   other comments and loaded questions will get removed. All the usual   rules of the sub remain in force here, so **be nice to each other** \\- you can disagree with someone's opinion, but don't make it personal.",
        "comments": [
            "Why is the MAGA base so upset with Trump over the Epstein files? It’s a genuine question because he has said some really outrageous and outlandish things that the people believed without question (like Obama being a Muslim or having a fake birth certificate). So what’s changed now - Trump is saying there’s nothing significant in the files. As claims go it’s not particularly unbelievable - I mean if any president said “we investigated throughly and found no significant evidence. The files were just rumors and there’s no clear evidence that any of it is real” it’s pretty plausible right? Much more so than claiming another president’s birth certificate is a fake. \nSo why is the MAGA base having such a hard time buying this explanation?",
            "Gerrymandering \n\nIf texas goes, looks like many states will too. What party benefits the most? Is this even conceivable?",
            "Does anyone know when the current era of extreme political tribalism really got started? I'm not American but I feel like when I was young, the late 80's and early 90's there was at least some politicians on both sides who routinely worked together and I feel like that doesn't really happen anymore.\n\nBut I have no idea if there was an inciting incident or if it just kind of drifted over time."
        ],
        "tag": ""
    },
    {
        "subreddit": "NoStupidQuestions",
        "title": "Are most people in China and Russia just living regular lives?",
        "body": "Being American, you’re taught most of your life that China and Russia are dictatorships where the people could never hope to live the life the average person in the US lives. \n\nNow, watching the US devolve into an autocracy while my day to day life really doesn’t change it all, it’s made me wonder if the average random person in these countries is living the same relatively comfortable, happy life I am.\n\nEdit: did not expect this to blow up so much. I have traveled quite a bit, but mostly in Europe. I'm well aware of the American narrative of Universal Healthcare=Socialism=Bad and have spent countless hours debating that with friends and family. I guess I just haven't had to think too much about autocracies because my comparison of the US to other countries has always been what I hoped we could become, but now I'm having to compare in the context of what we are becoming.",
        "comments": [
            "> if the average random person in these countries is living the same relatively comfortable, happy life I am\n\n\nBelieve it or not, most people live their normal lives.",
            "I'm in Russia and just live my ordinary life, sometimes from paycheck to paycheck (but tbh I buy a lot more fancy food than needed), my household is two adults and a few pets. We are just trying our best, go to work, go to the cinema as entertainment, on weekends build our  countryhouse by our own hands,  planning to buy a little bigger apartment and a better car in the near future,  planning what we will do in our retirement years.",
            "Living in Russia. My life is normal by my definition of normal. Maybe poorer than the average American's. I bought my house via mortgage. I have an abundance of choices for what to eat and what to do for my entertainment. I wake up, I work, I walk my dog, I feed my pets, I go to sleep. The only noticeable difference is that you guys had known more presidents than me - I feel like I've known Putin for ages. When I was a kid I thought his pictures were actually my uncle's because they both were balding. Also I don't get excited about elections, I guess"
        ],
        "tag": ""
    },
    {
        "subreddit": "NoStupidQuestions",
        "title": "How do humans smell inside?",
        "body": "I’m curious about something and I hope it isn’t too strange to ask. I don’t mean the smell of a cadaver during dissection, but rather when surgeons operate on a living patient. Does the human body have a noticeable smell on the inside—like from tissues, blood, or organs—that medical professionals become aware of during surgery? Or is it mostly odorless unless something unusual (like infection) is present?\n\nI’ve worked with farm animals before, and I’ve noticed that pigs, chickens, and sheep each have their own unique internal smell.\n\nDoes a person’s diet or lifestyle affect whether that smell is stronger or unpleasant?\n\nI hope this is not against rule 8.",
        "comments": [
            "Med student here. The inside of the body itself doesn’t really have any smell (unless there is some sort of gangrene going on). What you mostly notice in surgery is the burnt smell from cautery (used to stop bleeding). That said, during an endoscopy, we once had a big fart escape, and the whole room was hit with a truly awful stench.",
            "I'm no expert but I'd imagine it probably depends where you are in the body. The intestines probably don't smell wonderful. But I've never considered how the inside my skull might smell, for example. What does a brain smell like? Well shit, now I want to know too.",
            "Many factors to take into account. \nI am a funeral director / embalmer and we deal with various types of embalmings. \n\nDuring an autopsy there is an overwhelming smell of “copper”. Most cancer patients tend to have more of a fruity, sweet smell due to the ports and the presence of medication. \nWe obviously have the occasional decomp which smells, well, terrible…\n\nBut as far as the “inside” of a body, the viscera (heart, lungs, intestines) has many factors, but overall the smell reminds me of a large jar of pennys or spare change. Haha"
        ],
        "tag": ""
    },
    {
        "subreddit": "NoStupidQuestions",
        "title": "If the two major US parties went all out on a gerrymandering tit-for-tat, who comes out with more seats?",
        "body": "",
        "comments": [
            "There isn't a straightforward answer to that. The \"optimal\" gerrymander gives your party the smallest possible majority in every district they win, in order to win the most districts. But the smaller the majority you give, the more likely it is to backfire with even a small shift in votes, and you end up anti-gerrymandering yourself. And voting patterns never stop changing.",
            "In a recent Checks and Balances podcast from the Economist, they said if all democrats and all republican states gerrymander democrats would, on net, gain one seat.",
            "It will basically be the exact same as it is now, except each party will have a lot more \"guaranteed\" seats. Districts that are competitive tend to produce better candidates from both parties. Districts that aren't competitive tend to produce really crappy candidates that just need to win a party over. "
        ],
        "tag": ""
    },
    {
        "subreddit": "NoStupidQuestions",
        "title": "I have one hundred thousand US dollars. Would that be enough to immigrate to Latin America and live without working for the rest of my life?",
        "body": "",
        "comments": [
            "Are you 90?",
            "How long is the rest of your life?",
            "No"
        ],
        "tag": ""
    },
    {
        "subreddit": "NoStupidQuestions",
        "title": "Does it come off weird to say something to him after he ignored my last message about sending a nude?",
        "body": "Me and this guy recently agreed to be fwb's. He wanted a couple pics earlier this week so I first sent one of my chest and then he wanted an ass pic but the one I had didn't look good. He asked for it a few times (I TOLD him it didn't look good either) and then later, I also asked when I'm getting a dick pic (he had only sent shirtless pics at this point) and he said when he gets my ass pic. So I sent him that, and then we started talking about meeting up. We had some back and forth with that (our last convo was about deciding to do it in september, but before this, he said he tends to lose interest if it's too far out so not sure if this affected things).\n\nI reached out last night (a day after we decided we'd just meet up in september) and asked if I still get a pic. He didn't reply.. it's fine if he's not comfy to send pics, but if you can use your words to get some from me, then you can use your words to tell me you aren't comfy to send any. I was thinking of waiting a couple days and saying something (polite) cuz that kind of behavior irks me. Like you can change your mind on talking to me but don't ignore me. Thoughts? ",
        "comments": [
            "It’s not weird, it’s normal to want clarity. Ghosting sucks. Wait a day or two, then text something like, “Hey, if you’re not comfy sending pics, just say so. Better than being ignored",
            "Do you know him outside of texts?",
            "\"When I get an ass pic\" nope. You gave a pic, he asked for more, and didn't reciprocate what you already sent.\n\nYou provided, he didn't. I'd drop him and ignore him when he reaches out.\n\nA lot of people say they want to get together, but what they actually want is a fantasy to masturbate to. If someone asks for a pic, they need to provide one first."
        ],
        "tag": ""
    },
    {
        "subreddit": "NoStupidQuestions",
        "title": "What happens if someone dies and you can't afford a funeral or cremation?",
        "body": "I live pretty much paycheck to paycheck so something like a funeral is way outside of my price range, even cremation which is like 800$  is still way more than I could afford. But no one's waiting for you to become financially stable to die. No one just have like 15k lying around for a funeral. So what happens if you just don't have money for a funeral or a cremation? ",
        "comments": [
            "In Amsterdam, if you die without anyone to take care of the funeral the municipality will pay and send a poet to your funeral to recite a poem for you.",
            "This was my grandmothers situation. She got all the paperwork together to be donated to science after her passing. They came and collected her when she passed and my grandfather got her cremated remains back about six months later. It's a good option for those who cannot afford to do the process themselves.",
            "I'm 75M\n\nDepends on precisely which state you live in if you are in the US.\n\nIn Minnesota, if family or friends do not come forward to handle it. by state law it becomes the county governments problem and expense. It's all codified in law. The county will assume custody of taking care of the arrangements. And will bury the person. They are prohibited from cremation unless it is known the the deceased wished for that. They will try to determine any religious affiliation and get hold of a chaplain or minister if applicable. Locate an available plot, purchase a basic coffin, conduct a ceremony. If the deceased had left any property worth anything the county will arrange a sale, deduct expenses. If any amount is left over will try to find surviving relative to give any remaining funds to.\n\nNo idea about other states."
        ],
        "tag": ""
    },
    {
        "subreddit": "NoStupidQuestions",
        "title": "Why do I always get the best ideas when I'm about to fall asleep?",
        "body": "Without fail, the exact moment I get cozy and my brain should be powering down for the night, suddenly I'm out here solving world hunger and coming up with million dollar business ideas. Like why is 11:47 PM the optimal time for my brain to be like \"hey son, what if we revolutionized the entire transportation industry tho?\" But if I grab my phone to write it down, boom wide awake for the next 2 hours staring at the ceiling. And if I don't write it down by morning it's gone forever like it never happened. It's like my brain is actively trolling me. Oh you want to sleep? Here's the cure for climate change thank me later. \n\nIs this just a universal human experience or is my brain just wired differently?\n\nAnyone else's subconscious have the worst timing known to mankind?",
        "comments": [
            "It’s an illusion that the idea is good because your reasoning centers are throttled down. \n\nIt’s like when you dream something and wake up thinking that it’s a great idea. 15 minutes later when you are fully awake you realize it was dumb or didn’t actually make any sense.",
            "It's probably similar to \"highdeas\".  Things that sound fantastic when you're high. :)  Your brain, as you are about to fall asleep, is not operating with peak logical efficiency, and even silly ideas may register as profound.",
            "oh yeah, my brain does this constantly. start to drift off and then i plan out the way to get universal healthcare."
        ],
        "tag": ""
    },
    {
        "subreddit": "NoStupidQuestions",
        "title": "For generational dictators like Kim Jong-un, do they realize how bad they are, or are they also \"brainwashed\" by all the years of heavy propaganda.",
        "body": "This isn't an excuse for the cruelty for what North Korean citizens face, just genuine curiosity in how growing up to be the dictator would be like in a country like that. Your whole life, just as with the rest of the country, you're fed that this is what is supposed to be, this is okay, this is normal. Being the leader means you are the best thing to the country, so whatever you say or think MUST be the best thing for the country.\n\nSo do you think with his upbringing, do you think that Kim jong-un realizes how bad his dictatorship is? I'm sure he knows what other countries think of him, but he could just as easy justify it as then being jealous or hating North Korea because of their history.",
        "comments": [
            "I think it’s a bit of both. He definitely knows the outside world sees him as a dictator, but when you grow up your whole life being told you’re basically the savior of your country and surrounded by people who agree with you, that becomes your reality. Add in constant propaganda and no one around to challenge you, and it’s pretty easy to believe you’re doing the right thing, even if it’s cruel. He probably just brushes off criticism from other countries as jealousy or hate, because that’s a lot easier than admitting you’re the bad guy.",
            "Hereditary dictators tend to be raised on the kool-aid, so they're probably most likely to genuinely believe that they are chosen/best to lead. But I think all of them have a deluded sense of self-worth/competence/vision to some degree or another, else they wouldn't be where they are.",
            "When it comes to Kim Jong Un, I think part of it is simple self-preservation (at any cost). He was born into a dynastic system where his only real legitimacy comes from being a Kim. If he had refused the role, another faction or sibling would have taken over, and he probably would have been eliminated as a threat. If he tried to reform or open the country, the regime could collapse and he’d likely end up dead or replaced.\n\nThat doesn’t excuse the brutality of his rule, but it shows how impossible the bind is. His path was basically predetermined: dictatorship or death. It’s sad what the people of North Korea are enduring, but it’s also naive to imagine he could just wave his hand, say “you’re free now,” and everyone would live happily ever after."
        ],
        "tag": ""
    },
    {
        "subreddit": "NoStupidQuestions",
        "title": "I don’t understand why some people can’t sit in silence or alone without noise. Why does this become hard?",
        "body": "I ask this bc my (26F) boyfriend (24M) always has to eat with background noise. We’re at the dinner table and he has his iPad with YouTube. Or in other instances where we’re falling asleep and he has YT playing. I’m so use to quiet and silence. Especially my sleep and he calls me weird 😂 I’m curious to everyone else why this is the case",
        "comments": [
            "I have ADHD and OCD, and even with medication my brain does tend to race and wander. it makes me feel restless if I don’t get enough stimulation into it. I don’t need noise, per se, but I need some sort of sensory input.",
            "I work with people who have had a trauma, they are unable to sit in quiet and need a constant distraction to keep going from moment to moment.",
            "The most likely cause is uncomfortable thoughts or feelings when there is silence. If correct, this may go way back and he’s not even aware that this is why. You might need to sit in separate spaces occasionally so you can get your fix of peace :)"
        ],
        "tag": ""
    },
    {
        "subreddit": "NoStupidQuestions",
        "title": "Why did the CEO gave me a deck of cards to organize during the interview?",
        "body": "I’m just here to learn something. \nI’ve never seen this tactic before and cannot find anything about it online. What was the point of me organizing the deck of cards other that to just see if I could? There was a 6 missing also. ",
        "comments": [
            "Did you ask if he had a preference in how they were sorted?  My instinct would be by suit in numeric order. But it could have been by number in suit order.",
            "They are checking your sort algorithm I suppose."
        ],
        "tag": ""
    },
    {
        "subreddit": "NoStupidQuestions",
        "title": "How hard would it likely be for alien to figure out how to play it?",
        "body": "i guess i’m wondering how obvious the design of a dvd player could be from just having a DVD itself to work off of",
        "comments": [
            "I mean they'd figure out the \"it's a digital optical disc\" part quickly. Under a microscope it's a single spiral of tiny pits, so a red-ish laser and a photodiode would give them a clean bitstream.\n\nThe hard part is the stack above that. "
        ],
        "tag": ""
    },
    {
        "subreddit": "NoStupidQuestions",
        "title": "Is my husband using drugs?",
        "body": "I found empty cigarette packs with used rubber gloves crumpled up inside. Some of the gloves look like they have blood inside. I've never seen any track marks on him and I've never known him to do this, but as we all know, every one has their secrets. Each empty pack has one or two gloves inside. They are all different colours. He doesn't use rubber gloves for work or at home. Does any one know if this is for drug use?",
        "comments": [
            "Ex restaurant employee here. I don’t know how much weight it carries, but many servers where I used to work would put on a rubber glove to go outside for a smoke so their hand wouldn’t smell like a cig. The smoke, depending on how hot/humid it was, would stain the tips of the fingers that dry brown color. Did he recently tell you he was quitting smoking? Maybe he’s just hiding it."
        ],
        "tag": ""
    },
    {
        "subreddit": "NoStupidQuestions",
        "title": "Why do people get prenups?",
        "body": "So I've been seeing posts about prenups and I'm confused. Isn't it weird to plan for divorce before marriage? I get it's for protecting assets, inheritance, or a business, but can't you just not put your spouse's name on things? Also, how do you bring it up without killing the vibe? Is this mostly for rich people, or do regular folks do it too? I've heard it can make divorce easier, but shouldn't the focus be on not getting divorced? Not judging, just trying to understand. ELI5 please.",
        "comments": [
            "From an emotional standpoint, the best case I've heard in favor of prenups is \"you're protecting the person you love from a future version of yourself who doesn't love them.\"",
            "Regular divorce laws in many states don't really cover the situation where one person has significantly more assets than the other."
        ],
        "tag": ""
    },
    {
        "subreddit": "NoStupidQuestions",
        "title": "I’ve read that if you hit a parked car you should leave a note on the windshield.",
        "body": "What if the note blows away in the wind before the owner of the hit car returns? Can you get in trouble then?",
        "comments": [
            "You're supposed to put it on the windshield, held down by the wiper. Not just loose",
            "In Germany it's still considered fleeing the site of an accident.\n\n\nIf you can't get a hold of the owner of the car it's best to get the police involved "
        ],
        "tag": ""
    },
    {
        "subreddit": "NoStupidQuestions",
        "title": "Are hotel room cleaners happy when they see a “Do not disturb” sign?",
        "body": "I never care about getting my hotel room cleaned if I’m just there for a night or two. I don’t need new towels or my bed made. How can I make the lives of the cleaning staff easier?",
        "comments": [
            "The daily housekeeping/cleaning/stayover service is only a small part of the day, but all those signs make my day. In some places we have to go check a second time, so there's still a chance we have to do it, but the guests having their DND's out all day are my heroes ❤️",
            "Because they have to come back later? \nI put that sign up the whole week lol"
        ],
        "tag": ""
    },
    {
        "subreddit": "NoStupidQuestions",
        "title": "How do guys with butt chins shave the crack?",
        "body": "Do they have to pull the skin out or smth?",
        "comments": [
            "This took me way too long to decipher ",
            "They usually just pull/stretch the skin gently. A lot of guys also use a mirror or go slow in the shower so they don’t nick themselves. Definitely not fun but doable",
            "Sometimes don’t do it well. \n\nAnd I have a white spot of scruff right there…..TEENY soul patch. \n\nI’ve had people tell me I had toothpaste on my chin. "
        ],
        "tag": ""
    },
    {
        "subreddit": "NoStupidQuestions",
        "title": "Do new iPhones actually have worse batteries or am I just overthinking it?",
        "body": "Every time I get the newest iPhone the battery seems to die faster than my old one did when it was new. Within a few months I'm charging way more often.\n\nDo newer iPhones actually have worse batteries or could it be that phones are doing more in the background now maybe the brighter screens and heavier apps drain battery quicker even though the capacity is better\n\nIt feels like each \"upgrade\" comes with a battery downgrade. Has anyone else noticed this?",
        "comments": [
            "iPhones didn’t get worse batteries, apps just got bigger appetites.",
            "On an older iPhone, you had much more optimised apps and less processes running constantly, making it seem like it lasted forever. You also didn't have as many things keeping you literally stuck on the screen like doomscrolling."
        ],
        "tag": ""
    },
    {
        "subreddit": "NoStupidQuestions",
        "title": "Why don't they make weed-eaters with steel cable instead of plastic string?",
        "body": "",
        "comments": [
            "Super dangerous, metal is both more likely to tear up flesh, but also more likely to break into dangerous splinters of metal as opposed to less harmful plastic ",
            "so people dont get maimed"
        ],
        "tag": ""
    }
]