[
    {
        "subreddit": "cartoons",
        "title": "K-pop demon hunters is just everything Disney believes we don't want anymore.",
        "body": "Seriously, I just watched the movie and loved it.\n\nAnd it did occur to me, it did a lot of things Disney USED to do.\nBut apparently they think we don't want.\n\nSuch things as;\n\n*Traditional romance.\n\n*An obvious and evil villain, who in this case is just an actual demon lord.\n\n*Quiet scenes to give us a break between the show pieces. The animal sidekicks are not flailing all across the screen, they are actually very subdued. \n\n*The song writer clearly having worked closely with the story writers and animators through the WHOLE production, from pre to post. So it is written like you would write a Broadway musical.\n\n*Original movie\n\n*Not every song is a show stopper, but each song perfectly represent the scene it needs to convey.\n\n*Picking a setting and committing to it, rather than thinking you need to represent the entire planet every movie.\n\n*Message is secondary to the story, and flows naturally from it. They clearly didn't begin with the message, they begun with a fun idea that eventually evolved into a message.\n\nALL of this used to be normal for Disney... crazy to think about.\n\nBut so great to see a new movie getting it.\n\n\n\n",
        "comments": [
            "**Open Question**: Does this post follow our community's [rules](https://www.reddit.com/r/cartoons/about/rules)?\n\nUpvote this comment for yes.    \nDownvote for no.\n\n^(This post has not been removed. Please report rule breaking content.)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cartoons) if you have any questions or concerns.*",
            "There's a lot of very successful movies that are exactly what you described, though. \n\nMoana (both), Frozen (both), Elemental, Zootopia, etc etc. \n\nAudiences clearly *do* want what you described. \n\nUnless you're basing your entire argument on Wish.",
            "What do you mean by \"traditional romance\" and not representing a whole planet?\n\n\nRumi and Jinu's romance is the definition of non traditional. The main hero and the main villain getting together is not traditional. The main villain dying to save the main hero is not traditional. Rumi being half demon is not traditional. And what do you mean by complaining about representation?"
        ],
        "url": "https://www.reddit.com/r/cartoons/comments/1mlov35/kpop_demon_hunters_is_just_everything_disney/",
        "tag": ""
    },
    {
        "subreddit": "netflix",
        "title": "K POP Demon Hunters is INCREDIBLE!",
        "body": "I’m an adult male and I never listen to K POP or watch animation, yet I’m totally hooked on this movie, I’ve seen it like three times already. I got the sound track playing on my Spotify every day, such a catchy song, Golden, is amazing. Everyone I know is totally hooked on this movie. Sony did an incredible job with this movie. Glad it’s on Netflix and I can watch it anytime I want!",
        "comments": [
            "This post is so funny cause i randomly put this on last night while i was looking for something to watch. I don’t watch much TV so i got tired of searching for something. I needed some light tv so i just put this on as background noise. I was scrolling on my phone and eating and in something in the movie caught my attention. Next thing i know, im sitting up, fully focused, watching the movie with my phone away. I really enjoyed this.",
            "I (50F) watched it with my 19 year old daughter and we both really enjoyed it. I was surprised at how good it was, both story wise and songs. It made fun of K-pop in such a loving way, if that makes sense. Like it embraced the cringe instead of being embarrassed. Really sweet and a good message about dealing with trauma and not hiding yourself.",
            "Watched with the wife and kids. We enjoyed it more than the kids. Soda pop keeps getting stuck in my head, Idol is stuck in hers. Wife wants to make a stuffy of the demon cat."
        ],
        "url": "https://www.reddit.com/r/netflix/comments/1mhzsi2/k_pop_demon_hunters_is_incredible/",
        "tag": ""
    },
    {
        "subreddit": "Music",
        "title": "The K-Pop industry is disturbing and has a dark side that is hard to ignore.",
        "body": "The music industry as a whole is dark and ugly, but I have a particular hatred for the K-Pop industry. It’s a well-oiled machine. Young teens are groomed to perfection by these large entertainment companies with the sole purpose of making as much money as they can from their “investments”. \n\nKids sign their lives away to these entertainment companies and are under strict control and supervision throughout their entire careers. They leave their families as young teens for training, with no guarantee to be a part of any group for years. And through all this, they are subjected to mental and physical abuse, which has pushed some k-pop artists to commit suicide. The pressures of the industry and the fans in South Korea are enormous, and Asia in general is on an entirely different level. \n\nThese k-pop stars also have no say in any creative aspect of their music or performances. Every little detail and idea comes from the entertainment company. This aspect of the industry is troubling because it solidifies the idea of these kids as possessions, not people. How sad is it to pursue a music career knowing you will never be able to express yourself creatively, which is likely included in the contract they sign. \n\nLet’s end it on this gem. These entertainment companies, their CEOs and even some of the actual stars, have orchestrated a prostitution ring to lure foreign investors to invest in these shit companies. Women have been drugged, raped and sexually assaulted, and in some cases filmed without their knowledge or consent. \n\nThe k-pop industry likes to project an image of glamour and perfection, but the reality is much more sinister.",
        "comments": [
            "On David Tennant's podcast he interviewed Billie Piper. She described her experience as a pop star and it was similar enough. Living on her own in London at 13. All the details and ideas coming from the entertainment industry. It was also dark and disturbing. She admitted it left her with serious issues that it took years to overcome. And she was lucky enough to say no and get out after a time.",
            "This is accurate for any industry in which minors are used to generate income. USA gymnastics anyone?",
            "The lack of people willing to do their own research and accept things at face value will always astonish me. I know you all know this only part of the story. People unwilling to fully research topics themselves is just exhausting. \n\nThe Kpop industry has many problems, as does every other entertainment industry in the world. Some changes are starting to happen and have been happening because all of this is known."
        ],
        "url": "https://www.reddit.com/r/Music/comments/m4ura1/the_kpop_industry_is_disturbing_and_has_a_dark/",
        "tag": ""
    },
    {
        "subreddit": "kpoprants",
        "title": "Why do many K-pop fans lack personal hygiene?",
        "body": "I’m sorry if this offends anyone but I just can’t take it anymore lol.\n\nI’ve attended to various concerts but I’ve noticed the attendees at K-pop concerts have the worst BO/self-neglect. It doesn’t matter wether I’m in GA or seated; almost every concert I go to, there’s always some **strong** foul odor. The main ones I always smell are halitosis (bad breath), onion armpits, and dead animal.\n\nI get people like camping overnight to get into the venues early but why can’t we pack some toiletries and freshen up a bit? Why are we neglecting ourselves for people who don’t even know we exist?\n\nEdit: For the people who say that some can’t help but stink after sweating, I get that. I am not talking about simple sweating and then stinking, I’m talking about out how many K-pop fans lack hygiene in general (or sacrifice basic self care for the concert). I do not think decaying animal and halitosis stenches are warranted by sweating for a couple hours.\n\nEdit 2: I never said the stink was limited to K-pop concerts. However, K-pop fans do have some of the worst BO I’ve ever smelled.",
        "comments": [
            "Thank you for posting at r/kpoprants. [OP and commenters are expected to have read our general rules before posting.](https://www.reddit.com/r/kpoprants/wiki/rules/rules/)\n***\n#### &#x1F4CC; This is a discussion forum! Please remember to engage productively and respectfully!\n#####Any singular comment or mention of lines like or similar to:\n\n* It’s not that deep\n* Nobody cares, no one is reading this, etc\n* Why do you care about this?\n* Just ignore it, just unstan, just stop listening to, etc\n* Not this post again, why are you always ranting about, etc\n* This is just a hate/anti post/OP is not a real fan of X, etc\n#####[Will be removed and subject to a ban.](https://www.reddit.com/r/kpoprants/comments/17v33io/town_hall_9_the_end_of_its_not_that_deep_2/?utm_source=share&utm_medium=web2x&context=3)\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/kpoprants) if you have any questions or concerns.*",
            "Found Wonyoung's alt account\n\nhttps://preview.redd.it/9tjibjxe7mgf1.png?width=1080&format=png&auto=webp&s=15afc88811a97cd4d723b99a826dce67915549ef",
            "ateez at o2 arena in january 🤮 the person in front of me kept lifting their arms to put around their friend or cheer/dance and it was so hard not to say something. i could hear them bragging about queuing since 7am… we can tell (side note:completely unnecessary when i got there at 1pm and was one spot behind them lol)"
        ],
        "url": "https://www.reddit.com/r/kpoprants/comments/1mfkpxw/why_do_many_kpop_fans_lack_personal_hygiene/",
        "tag": ""
    }
]