[

    {
        "subreddit": "kpoprants",
        "title": "Why do many K-pop fans lack personal hygiene?",
        "body": "I’m sorry if this offends anyone but I just can’t take it anymore lol.\n\nI’ve attended to various concerts but I’ve noticed the attendees at K-pop concerts have the worst BO/self-neglect. It doesn’t matter wether I’m in GA or seated; almost every concert I go to, there’s always some strong foul odor. The main ones I always smell are halitosis (bad breath), onion armpits, and dead animal.\n\nI get people like camping overnight to get into the venues early but why can’t we pack some toiletries and freshen up a bit? Why are we neglecting ourselves for people who don’t even know we exist?\n\n",
        "comments": [
            "the person in front of me kept lifting their arms to put around their friend or cheer/dance and it was so hard not to say something. i could hear them bragging about queuing since 7am… we can tell (side note:completely unnecessary when i got there at 1pm and was one spot behind them lol)"
        ],
        "url": "https://www.reddit.com/r/kpoprants/comments/1mfkpxw/why_do_many_kpop_fans_lack_personal_hygiene/",
        "tag": ""
    },
    {
        "subreddit": "Music",
        "title": "The K-Pop industry is disturbing and has a dark side that is hard to ignore.",
        "body": "The music industry as a whole is dark and ugly, but I have a particular hatred for the K-Pop industry. It’s a well-oiled machine. Young teens are groomed to perfection by these large entertainment companies with the sole purpose of making as much money as they can from their “investments”. \n\nKids sign their lives away to these entertainment companies and are under strict control and supervision throughout their entire careers. They leave their families as young teens for training, with no guarantee to be a part of any group for years. And through all this, they are subjected to mental and physical abuse, which has pushed some k-pop artists to commit suicide. The pressures of the industry and the fans in South Korea are enormous, and Asia in general is on an entirely different level. \n\n",
        "comments": [
            "On David Tennant's podcast he interviewed Billie Piper. She described her experience as a pop star and it was similar enough. Living on her own in London at 13. All the details and ideas coming from the entertainment industry. It was also dark and disturbing. She admitted it left her with serious issues that it took years to overcome. And she was lucky enough to say no and get out after a time.",
            "This is accurate for any industry in which minors are used to generate income. USA gymnastics anyone?"
        ],
        "url": "https://www.reddit.com/r/Music/comments/m4ura1/the_kpop_industry_is_disturbing_and_has_a_dark/",
        "tag": ""
    },
    {
        "subreddit": "formula1",
        "title": "What happened to Ferrari in 2005?",
        "body": "I’m in the middle of F1TV’s story of the season (the best thing on F1TV from 2000-2016), and while it does an amazing job of describing the F1 season week to week, I find it does a spotty job of describing the Ferraris’ step back in 2005. The story of the season focuses on Fernando’s rise but doesn’t spend much time on the decline of the Ferrari as a car, instead making Michael and Ferrari a secondary story on the season. The Ferrari returned to front row competitiveness in 2006, so what on earth happened in 2005.",
        "comments": [
            "They changed the tyre rules so you couldn't change your tyres during the race, and from memory also had to qualify on these tyres.",
            "Bridgestone didn’t adapt to that new rule anywhere near as well as Michelin, did which hurt Ferrari a lot as they were the biggest team running the Bridgestone thres.I think Ferrari also typically ran very aggressive tyre strategies in the previous few years, which wasn’t possible under that rule.\nOn top of all that, there were some changes to the aero regulations (the most notable being that the front wings had to be raised up) and I think that also impacted Ferrari a fair bit."

        ],
        "tag": ""
    },
    {
        "subreddit": "Aespa",
        "title": "I honestly can’t tell the difference between the members",
        "body": "I’m relatively new to Aespa - I love their songs and group dynamic. But for the life of me I can’t tell who is who is the group - I watch multiple clips and still get confused who is winter and who is karina\nIf anyone could give any tips on how to tell them apart it would be great!!",
        "comments": [
            "Watch more of their contents lol and maybe try remembering their voices? and match their speaking voices with the corresponding members.",
            "really? all 4 of them look very different from each other. focus on their faces and not on their hair or styling. even when all 4 had platinum bobs you could tell them apart"
        ],
        "tag": ""
    },
    {
        "subreddit": "formula1",
        "title": "Finally got round to watching the F1 movie today (me being a seasoned F1 fan)",
        "body": "I've been a bit down on the sport in recent times, a combination of not finding the racing as fun as I used to, of being ground down by DTS-focused media coverage and the shitty football-style fan factions. Having followed the sport for 40 odd years and spending a lifetime's fortune watching and reading it, I was getting to the point of jacking it all in.\nYet I watched this today, expecting another cynical Liberty money grab, and I was delightfully surprised. Sure, it's a movie and must be taken as such. But it is a very good movie. The best I've seen this year, and I watch a hell of a lot of movies.",
        "comments": [
            "Going back and watching Grand Prix (1966) and Le Mans (1971) reminded how great those movies are and in many ways how little has changed",
            "Yup. Good movies."

        ],
        "tag": ""
    },
    {
        "subreddit": "BlackPink",
        "title": "How involved do you think the girls will be in creating the of the new album?",
        "body": "In the past albums, we know they had minimal participation when it came to songwriting and production, but things are different now. They worked a lot in those areas on their solo projects. I can’t really imagine someone like Rosé and Jennie, who were so involved in creating their solo work, just letting other people handle that part without much input.\nAnyway… I’d love to see an album with all four of their touches in every little detail. I think they’ve already more than proven they can do it. How realistic do you think that expectation is?",
        "comments": [
            "They've always been involved, but not so much as on their solo projects",
            "To be honest, I don't think much. They were pretty much fully busy working on their solo careers for over a year and went straight into tour preparations from there on.",
            "I trust in Teddy. He can't miss."
        ],
        "tag": ""
    },
    {
        "subreddit": "BlackPink",
        "title": "So.. I kinda got my first BP album!",
        "body": "So I was kinda with my mom in the mall (yes as a male and 25 I still go to the mall with my mom, just something about it I love, maybe the memories), which has an FYE.. well I never really thought that it would even have any BLACKPINK albums, well I was wrong haha.. they had the “How You Like That” Single there, as well as Born Pink album, with a poster and Polaroids! I must’ve got lucky as I got BOTH of my bias of Jisoo and Rosé in the set!\nSadly I don’t have pictures currently, but I will in the morning!",
        "comments": [
            "I do enjoy going with my mom to places 😅 good for you for enjoying it",
            "Ah nothing like buying your first BP album ☺️ lucky that you got both your biases too!"

        ],
        "tag": ""
    },
    {
        "subreddit": "cartoons",
        "title": "K-pop demon hunters is just everything Disney believes we don't want anymore.",
        "body": "Seriously, I just watched the movie and loved it.\n\nIt reminded me of things Disney USED to do, though apparently they think we don't want them.\n\nTraditional romance, a clear villain, quiet scenes with subdued animal sidekicks, well-integrated songs, an original story, and a consistent setting.\n\nThe message flows naturally from the story rather than being forced.\n\nALL of this used to be normal for Disney... crazy to think about.\n\nBut so great to see a new movie getting it.\n\n\n\n",
        "comments": [
            "What do you mean by \"traditional romance\" and not representing a whole planet?\n\n\nRumi and Jinu's romance is the definition of non traditional. The main hero and the main villain getting together is not traditional. The main villain dying to save the main hero is not traditional. Rumi being half demon is not traditional. And what do you mean by complaining about representation?"
        ],
        "tag": ""
    },
    {
        "subreddit": "formula1",
        "title": "Songs that remind you of race series",
        "body": "Just something light hearted for today. What songs do you listen to that made you associate/reminds you of/goes well with a race series (any series) that you follow?\nFor example, \"Decalomania\" and \"Dampener Rod\" by Junkie XL (NFS Prostreet OST) reminds me of Indycar because they're fast paced, aggressive, and has that grunge vibes to it, like what you'd expect from a race event, be it on an oval or at a street course party.",
        "comments": [
            "Speedway at Nazareth, by Mark Knopfler and Emmylou Harris",
            "The Delta Force theme song!",
            "Jerry was a Race Car Driver by Primus always makes me think of USAC races on dirt tracks."
        ],
        "tag": "f1"
    },
    {
        "subreddit": "netflix",
        "title": "K POP Demon Hunters is INCREDIBLE!",
        "body": "I’m an adult male and I never listen to K POP or watch animation, yet I’m totally hooked on this movie, I’ve seen it like three times already. I got the sound track playing on my Spotify every day, such a catchy song, Golden, is amazing. Everyone I know is totally hooked on this movie. Sony did an incredible job with this movie. Glad it’s on Netflix and I can watch it anytime I want!",
        "comments": [
            "This post is so funny cause i randomly put this on last night while i was looking for something to watch. I don’t watch much TV so i got tired of searching for something. I needed some light tv so i just put this on as background noise. I was scrolling on my phone and eating and in something in the movie caught my attention. Next thing i know, im sitting up, fully focused, watching the movie with my phone away. I really enjoyed this.",
            "I (50F) watched it with my 19 year old daughter and we both really enjoyed it. I was surprised at how good it was, both story wise and songs. It made fun of K-pop in such a loving way, if that makes sense. Like it embraced the cringe instead of being embarrassed. Really sweet and a good message about dealing with trauma and not hiding yourself."
        ],
        "tag": ""
    }

]