[
    {
        "subreddit": "NoStupidQuestions",
        "title": "Why did the CEO gave me a deck of cards to organize during the interview?",
        "body": "I’m just here to learn something. \nI’ve never seen this tactic before and cannot find anything about it online. What was the point of me organizing the deck of cards other that to just see if I could? There was a 6 missing also. ",
        "comments": [
            "Did you ask if he had a preference in how they were sorted?  My instinct would be by suit in numeric order. But it could have been by number in suit order.",
            "They are checking your sort algorithm I suppose."
        ],
        "tag": ["Career"]
    },
    {
        "subreddit": "NoStupidQuestions",
        "title": "How hard would it likely be for alien to figure out how to play it?",
        "body": "i guess i’m wondering how obvious the design of a dvd player could be from just having a DVD itself to work off of",
        "comments": [
            "I mean they'd figure out the \"it's a digital optical disc\" part quickly. Under a microscope it's a single spiral of tiny pits, so a red-ish laser and a photodiode would give them a clean bitstream.\n\nThe hard part is the stack above that. "
        ],
        "tag": ["Technology"]
    },
    {
        "subreddit": "NoStupidQuestions",
        "title": "Is my husband using drugs?",
        "body": "I found empty cigarette packs with used rubber gloves crumpled up inside. Some of the gloves look like they have blood inside. I've never seen any track marks on him and I've never known him to do this, but as we all know, every one has their secrets. Each empty pack has one or two gloves inside. He doesn't use rubber gloves for work or at home. Does any one know if this is for drug use?",
        "comments": [
            "Ex restaurant employee here. I don’t know how much weight it carries, but many servers where I used to work would put on a rubber glove to go outside for a smoke so their hand wouldn’t smell like a cig. The smoke, depending on how hot/humid it was, would stain the tips of the fingers that dry brown color. Did he recently tell you he was quitting smoking? Maybe he’s just hiding it."
        ],
        "tag": ["Health", "Social"]
    },
    {
        "subreddit": "NoStupidQuestions",
        "title": "Why do people get prenups?",
        "body": "So I've been seeing posts about prenups and I'm confused. Isn't it weird to plan for divorce before marriage? I get it's for protecting assets, inheritance, or a business, but can't you just not put your spouse's name on things? I've heard it can make divorce easier, but shouldn't the focus be on not getting divorced? Not judging, just trying to understand. ELI5 please.",
        "comments": [
            "From an emotional standpoint, the best case I've heard in favor of prenups is \"you're protecting the person you love from a future version of yourself who doesn't love them.\"",
            "Regular divorce laws in many states don't really cover the situation where one person has significantly more assets than the other."
        ],
        "tag": ["Life", "Social"]
    },
    {
        "subreddit": "NoStupidQuestions",
        "title": "I’ve read that if you hit a parked car you should leave a note on the windshield.",
        "body": "What if the note blows away in the wind before the owner of the hit car returns? Can you get in trouble then?",
        "comments": [
            "You're supposed to put it on the windshield, held down by the wiper. Not just loose",
            "In Germany it's still considered fleeing the site of an accident.\n\n\nIf you can't get a hold of the owner of the car it's best to get the police involved "
        ],
        "tag": ["Life"]
    },
    {
        "subreddit": "NoStupidQuestions",
        "title": "Are hotel room cleaners happy when they see a “Do not disturb” sign?",
        "body": "I never care about getting my hotel room cleaned if I’m just there for a night or two. I don’t need new towels or my bed made. How can I make the lives of the cleaning staff easier?",
        "comments": [
            "The daily housekeeping/cleaning/stayover service is only a small part of the day, but all those signs make my day. In some places we have to go check a second time, so there's still a chance we have to do it, but the guests having their DND's out all day are my heroes ❤️",
            "Because they have to come back later? \nI put that sign up the whole week lol"
        ],
        "tag": ["Social"]
    },
    {
        "subreddit": "NoStupidQuestions",
        "title": "How do guys with butt chins shave the crack?",
        "body": "Do they have to pull the skin out or smth?",
        "comments": [
            "This took me way too long to decipher ",
            "They usually just pull/stretch the skin gently. A lot of guys also use a mirror or go slow in the shower so they don’t nick themselves. Definitely not fun but doable",
            "Sometimes don’t do it well. \n\nAnd I have a white spot of scruff right there…..TEENY soul patch. \n\nI’ve had people tell me I had toothpaste on my chin. "
        ],
        "tag": ["Health"]
    },
    {
        "subreddit": "NoStupidQuestions",
        "title": "Do new iPhones actually have worse batteries or am I just overthinking it?",
        "body": "Every time I get the newest iPhone the battery seems to die faster than my old one did when it was new. Within a few months I'm charging way more often.Do newer iPhones actually have worse batteries or could it be that phones are doing more in the background now maybe the brighter screens and heavier apps drain battery quicker even though the capacity is better?",
        "comments": [
            "iPhones didn’t get worse batteries, apps just got bigger appetites.",
            "On an older iPhone, you had much more optimised apps and less processes running constantly, making it seem like it lasted forever. You also didn't have as many things keeping you literally stuck on the screen like doomscrolling."
        ],
        "tag": ["Technology"]
    },
    {
        "subreddit": "NoStupidQuestions",
        "title": "Why don't they make weed-eaters with steel cable instead of plastic string?",
        "body": "",
        "comments": [
            "Super dangerous, metal is both more likely to tear up flesh, but also more likely to break into dangerous splinters of metal as opposed to less harmful plastic ",
            "so people dont get maimed"
        ],
        "tag": ["Technology"]
    }
]